 ----------------------------------------------------
#   Brew
# ----------------------------------------------------

brew 'autojump'
brew 'awscli'
brew 'bash'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'mas'
brew 'npm'
brew 'postgres'
brew 'python'
brew 'rbenv'
brew 'ruby-build'
brew 'starship'
brew 'the_silver_searcher'
brew 'tree'
brew 'vim'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

# ----- Disabled Packages ----- #

# brew 'bash-completion'
# brew 'reattach-to-user-namespace'
# brew 'tmux'
# brew 'tmuxinator'

# ----------------------------------------------------
#   Cask
# ----------------------------------------------------

cask '1password'
cask 'arc'
cask 'bartender'
cask 'bazecor'
cask 'bettertouchtool'
cask 'chatgpt'
cask 'cleanmymac'
cask 'cleanshot'
cask 'cursor'
cask 'docker'
cask 'elgato-stream-deck'
cask 'elgato-wave-link'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hazel'
cask 'homerow'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'limitless'
cask 'loom'
cask 'microsoft-edge'
cask 'moom'
cask 'nordlayer'
cask 'notion'
cask 'notion-calendar'
cask 'raycast'
cask 'rocket'
cask 'screen-studio'
cask 'tableplus'
cask 'transmit'
cask 'visual-studio-code'
cask 'whimsical'
cask 'zoom'

# ----- Not M1 Ready ----- #

# cask 'basecamp'
# cask 'nordvpn-teams'

# ----- Disabled Packages ----- #

# cask 'alfred'
# cask 'flux'
# cask 'istat-menus'
# cask 'sip'

# ----------------------------------------------------
#   MAS
# ----------------------------------------------------

mas 'Amphetamine', id: 937984704
mas 'Canva', id: 897446215
mas 'Cardhop', id: 1290358394
mas 'Fantastical', id: 975937182
mas 'Gifox 2', id: 1461845568
mas 'IA Writer', id: 775737590
mas 'MindNode', id: 1289197285
mas 'Perplexity', id: 6714467650
mas 'Portal', id: 1436994560
mas 'Slack', id: 803453959
mas 'ToothFairy', id: 1191449274

# ----- Disabled Packages ----- #

# mas 'Unsplash Wallpapers', id: 1284863847
