tap 'homebrew/cask-cask'

# ----------------------------------------------------
#   Brew
# ----------------------------------------------------

brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'github/gh/gh'
brew 'hub'
brew 'mas'
brew 'postgres'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'starship'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'

# ----------------------------------------------------
#   Cask
# ----------------------------------------------------

cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'backblaze'
cask 'bartender'
cask 'basecamp'
cask 'bettertouchtool'
cask 'cleanmymac'
cask 'dash'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'hazel'
cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'
cask 'keyboard-maestro'
cask 'moom'
cask 'notion'
cask 'omnigraffle'
cask 'rescuetime'
cask 'rocket'
cask 'sip'
cask 'sketch'
cask 'spotify'
cask 'tableplus'
cask 'transmit'
cask 'visual-studio-code'
cask 'quitter'
cask 'zoomus'

# ----------------------------------------------------
#   MAS
# ----------------------------------------------------

mas 'Amphetamine', id: 937984704
mas 'Cardhop', id: 1290358394
mas 'Fantastical', id: 975937182
mas 'Gestimer', id: 990588172
mas 'Gifox', id: 1082624744
mas 'MindNode', id: 1289197285
mas 'Next Meeting', id: 1017470484
mas 'Slack', id: 803453959
mas 'ToothFairy', id: 1191449274
mas 'Unsplash Wallpapers', id: 1284863847
