# ----------------------------------------------------
#   Brew
# ----------------------------------------------------

brew 'autojump'
brew 'awscli'
brew 'bash'
brew 'brave-browser'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'karabiner-elements'
brew 'mas'
brew 'nordlayer'
brew 'postgres'
brew 'python'
brew 'raycast'
brew 'rbenv'
brew 'ruby-build'
brew 'starship'
brew 'the_silver_searcher'
brew 'tree'
brew 'vim'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'

# ----- Disabled Packages ----- #

# brew 'bash-completion'
# brew 'reattach-to-user-namespace'
# brew 'tmux'
# brew 'tmuxinator'

# ----------------------------------------------------
#   Cask
# ----------------------------------------------------

cask '1password'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'cleanmymac'
cask 'cleanshot'
cask 'dropbox'
cask 'elgato-stream-deck'
cask 'elgato-wave-link'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hazel'
cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'
cask 'keyboard-maestro'
cask 'loom'
cask 'microsoft-edge'
cask 'moom'
cask 'notion'
cask 'rocket'
cask 'screen-studio'
cask 'sip'
cask 'tableplus'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'

# ----- Not M1 Ready ----- #

# cask 'basecamp'
cask 'nordvpn-teams'

# ----- Disabled Packages ----- #

# cask 'flux'

# ----------------------------------------------------
#   MAS
# ----------------------------------------------------

mas 'Amphetamine', id: 937984704
mas 'Cardhop', id: 1290358394
mas 'Fantastical', id: 975937182
mas 'Gifox 2', id: 1461845568
mas 'Slack', id: 803453959
mas 'ToothFairy', id: 1191449274

# ----- Disabled Packages ----- #

# mas 'MindNode', id: 1289197285
# mas 'Unsplash Wallpapers', id: 1284863847
